# 1. Data Analytics Using Python Pandas (EDA Using Pandas)

In [1]:
import pandas as pd
import numpy as np

In [30]:

# Dataframe used during this workshop
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)

df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

## 1. Top 3 Rows

In [31]:
df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

## 2. Bottom 3 Rows

In [32]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

## 3. All rows except last 2 rows

In [33]:
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

## 4. All rows except first 3 rows

In [34]:
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

## 5. Find the shape of the dataset

In [35]:
df1.shape

(7, 4)

In [36]:
print("Rows: ", df1.shape[0])
print("Colums: ", df1.shape[1])

Rows:  7
Colums:  4

In [37]:
df1.Marks.shape

# similar to
df1["Marks"].shape

(7,)

## 6. Dataset information

In [38]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

## 7. Check null values

In [39]:
df1.isnull()

    Name  Marks  Gender  Email
0  False  False   False  False
1  False   True   False  False
2  False  False   False  False
3  False  False   False  False
4  False   True   False  False
5  False  False   False  False
6  False  False   False  False

In [40]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

## 8. Get overall statistics

In [41]:
df1.describe()

           Marks
count   5.000000
mean   93.200000
std     7.628892
min    83.000000
25%    87.000000
50%    98.000000
75%    99.000000
max    99.000000

In [42]:
df1.describe(include='all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

## 9. Find unique values from the gender column/attribute

In [43]:
# show columns
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [44]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [45]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## 10. Find the count of each unique value

In [46]:
df1.Gender.nunique()

2

In [47]:
df1.nunique()

Name      7
Marks     4
Gender    2
Email     7
dtype: int64

## 11. Count of unique values in gender column

In [48]:
df1.Gender.value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [50]:
# similarly
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

## 12. Handling missing values

In [51]:
# show dataset
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

Notice that two values are missing from the marks column

In [52]:
df1.dropna(how='all')

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [53]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [54]:
df1.fillna(0)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    0.0  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    0.0    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [55]:
df1['Marks'] = df1['Marks'].fillna(df1['Marks'].mean())

In [56]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

## 13. Marks between 80 to 90

In [58]:
df1[(df1['Marks'] >= 80) & (df1['Marks'] <= 90)]

     Name  Marks  Gender             Email
3  Vedant   87.0    Male  vedant@yahoo.com
5  Mittal   83.0  Female  mittal@yahoo.com

In [59]:
sum((df1['Marks'] >= 80) & (df1['Marks'] <= 90))

2

In [60]:
# similarly
df1[df1['Marks'].between(80, 90)]

     Name  Marks  Gender             Email
3  Vedant   87.0    Male  vedant@yahoo.com
5  Mittal   83.0  Female  mittal@yahoo.com

In [61]:
sum(df1['Marks'].between(80, 90))

2

## 14. Students with lowest marks

In [62]:
# show columns
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [64]:
# compare values
df1[df1['Marks'].min() == df1['Marks']]

     Name  Marks  Gender             Email
5  Mittal   83.0  Female  mittal@yahoo.com

In [65]:
df1[df1['Marks'].min() == df1['Marks']]['Name']

5    Mittal
Name: Name, dtype: object

## 15. Top 5 students by their marks

In [66]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [77]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    krisha@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
4   Parshv   93.2    Male  parshv@hotmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
5   Mittal   83.0  Female    mittal@yahoo.com

In [82]:
df1.sort_values(by='Marks', ascending=False).head()

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    krisha@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
4   Parshv   93.2    Male  parshv@hotmail.com

In [85]:
df1.sort_values(by='Marks', ascending=False).head()[['Name', 'Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [78]:
# using .nlargest() method
df1.nlargest(5, 'Marks')

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    krisha@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
4   Parshv   93.2    Male  parshv@hotmail.com

In [84]:
# show the names only
df1.nlargest(5, 'Marks')['Name']

df1.nlargest(5, 'Marks')[['Name', 'Marks']]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

## 16. Find average marks

In [86]:
df1['Marks'].mean()

93.2

In [87]:
df1['Marks'].min()

83.0

In [88]:
df1['Marks'].max()

99.0

In [89]:
# using apply method by lambda function
df1['Half Marks'] = df1['Marks'].apply(lambda x: x / 2)

In [96]:
# check
df1

,Name,Marks,Gender,Email,Half Marks,Half Marks Def,Half Marks List
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,49.0
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,46.6
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,49.5
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,43.5
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,46.6
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,41.5
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,49.5

In [91]:
# using apply method by custom defined function
def half_marks(x):
    return x / 2

In [92]:
# apply the function
df1['Half Marks Def'] = df1['Marks'].apply(half_marks)

In [93]:
# check
df1

      Name  Marks  Gender               Email  Half Marks  Half Marks Def
0  Priyang   98.0    Male   priyang@gmail.com        49.0            49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6            46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5            49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5            43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6            46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5            41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5            49.5

In [94]:
# using list comprehension
df1['Half Marks List'] = [i / 2 for i in df1['Marks']]

In [95]:
# check
df1

,Name,Marks,Gender,Email,Half Marks,Half Marks Def,Half Marks List
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,49.0
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,46.6
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,49.5
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,43.5
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,46.6
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,41.5
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,49.5

## 17. Map function

In [97]:
# converting gender string to gender binary
df1['Gender Bin'] = df1['Gender'].map({'Male': 1, 'Female': 0})

In [98]:
# check
df1

,Name,Marks,Gender,Email,Half Marks,Half Marks Def,Half Marks List,Gender Bin
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,49.0,1
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,46.6,0
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,49.5,0
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,43.5,1
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,46.6,1
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,41.5,0
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,49.5,0

In [100]:
# delete column
# axis=1 means we're deleting column
df1.drop('Gender Bin', axis=1, inplace=True)
# inplace=True to overwrite the changed dataset

## 18. Sorting the dataframe by marks

In [101]:
df1.sort_values(by='Marks', ascending=False)

,Name,Marks,Gender,Email,Half Marks,Half Marks Def,Half Marks List
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,49.5
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,49.5
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,49.0
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,46.6
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,46.6
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,43.5
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,41.5

## 19. Names and marks of female students

In [102]:
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [103]:
# using isin method
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

## 20. Rename the marks columns

In [104]:
df1.rename(columns={'half_marks': 'Half Marks'})

,Name,Marks,Gender,Email,Half Marks,Half Marks Def,Half Marks List
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,49.0
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,46.6
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,49.5
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,43.5
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,46.6
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,41.5
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,49.5

## 21. Concatenate two datasets

In [108]:
# Dataframe used during this workshop
dict1_2 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1_2=pd.DataFrame(dict1_2)

In [106]:
dict2 = {'Name': 'Anil',
         'Marks': 90,
         'Gender': 'Male',
         'Email': 'anil@gmail.com'}

df2 = pd.DataFrame(dict2, index=[0])

In [112]:
# concatenate/merge dataset df1_2 and df2
df3 = pd.concat([df1_2, df2], ignore_index=True)

In [113]:
# show the merged dataset
df3

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com
7     Anil   90.0    Male      anil@gmail.com

## 22. Subsetting using loc and iloc

In [114]:
# Subsetting all rows in column 'Marks' and 'Gender'
df3.loc[:, 'Marks': 'Gender']

   Marks  Gender
0   98.0    Male
1    NaN  Female
2   99.0  Female
3   87.0    Male
4    NaN    Male
5   83.0  Female
6   99.0  Female
7   90.0    Male

In [115]:
# using iloc
# accessing all rows in column number 3
df3.iloc[:, 3]

0     priyang@gmail.com
1      aadhya@gmail.com
2      krisha@gmail.com
3      vedant@yahoo.com
4    parshv@hotmail.com
5      mittal@yahoo.com
6     archana@yahoo.com
7        anil@gmail.com
Name: Email, dtype: object

In [120]:
# merging two columns into one column
df3['Name , Marks'] = df3['Name'] + ', ' + df3['Marks'].apply(str)

In [121]:
# check
df3

      Name  Marks  Gender               Email   Name , Marks
0  Priyang   98.0    Male   priyang@gmail.com  Priyang, 98.0
1   Aadhya    NaN  Female    aadhya@gmail.com    Aadhya, nan
2   Krisha   99.0  Female    krisha@gmail.com   Krisha, 99.0
3   Vedant   87.0    Male    vedant@yahoo.com   Vedant, 87.0
4   Parshv    NaN    Male  parshv@hotmail.com    Parshv, nan
5   Mittal   83.0  Female    mittal@yahoo.com   Mittal, 83.0
6  Archana   99.0  Female   archana@yahoo.com  Archana, 99.0
7     Anil   90.0    Male      anil@gmail.com     Anil, 90.0

## 23. Find the highest average value for by gender

In [122]:
df3['Marks'].groupby(df3['Gender']).mean()

Gender
Female    93.666667
Male      91.666667
Name: Marks, dtype: float64

In [123]:
# similarly
df3.groupby('Gender')['Marks'].mean()

Gender
Female    93.666667
Male      91.666667
Name: Marks, dtype: float64

In [124]:
# sorting
df3.groupby('Gender')['Marks'].mean().sort_values(ascending=False)

Gender
Female    93.666667
Male      91.666667
Name: Marks, dtype: float64

In [125]:
# check the type
type(df3.groupby('Gender')['Marks'].mean().sort_values(ascending=False))

pandas.core.series.Series

In [126]:
# convert to dataframe
df3.groupby('Gender')['Marks'].mean().sort_values(ascending=False).to_frame()

            Marks
Gender
Female  93.666667
Male    91.666667

## 24. Top 5 most popular email providers

In [128]:
mail_providers = []

for email in df3['Email']:
    mail_providers.append(email.split('@')[1])

In [129]:
mail_providers

['gmail.com',
 'gmail.com',
 'gmail.com',
 'yahoo.com',
 'hotmail.com',
 'yahoo.com',
 'yahoo.com',
 'gmail.com']

In [130]:
df3['Mail Providers'] = mail_providers

In [131]:
df3

      Name  Marks  Gender               Email   Name , Marks Mail Providers
0  Priyang   98.0    Male   priyang@gmail.com  Priyang, 98.0      gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com    Aadhya, nan      gmail.com
2   Krisha   99.0  Female    krisha@gmail.com   Krisha, 99.0      gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com   Vedant, 87.0      yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com    Parshv, nan    hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com   Mittal, 83.0      yahoo.com
6  Archana   99.0  Female   archana@yahoo.com  Archana, 99.0      yahoo.com
7     Anil   90.0    Male      anil@gmail.com     Anil, 90.0      gmail.com

In [132]:
df3['Mail Providers'].value_counts()

Mail Providers
gmail.com      4
yahoo.com      3
hotmail.com    1
Name: count, dtype: int64

In [136]:
# single line using lambda function
df3['Email'].apply(lambda x: x.split('@')[1]).value_counts().head()

Email
gmail.com      4
yahoo.com      3
hotmail.com    1
Name: count, dtype: int64